rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def similar
    @id = params[:id]
    @movies = Movie.movies_with_same_director(@id)
    if @movies.nil?
      currentmovie = Movie.find(@id)